test/multiphase/multiphaseEulerFoam/populationBalance/isothermalGrowth/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

options
{
    massSource
    {
        type            semiImplicitSource;

        selectionMode   cellZone;
        cellZone        injection;

        volumeMode      absolute;

        sources
        {
            thermo:rho.air1
            {
                explicit    1e-03;
                implicit    0;
            }

            U.air1
            {
                explicit    (0 2.78e-02 0);
                implicit    0;
            }

            f0.air1.bubbles
            {
                value       1.0;
                explicit    #calc "$value*$../thermo:rho.air1/explicit";
                implicit    0;
            }
        }
    }
}
