test/multiphase/multiphaseEulerFoam/populationBalance/isothermalGrowth/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type populationBalanceMultiphaseSystem;

phases (air1 air2 air3 water);

referencePhase  water;

populationBalances (bubbles);

air1
{
    type                pureIsothermalPhaseModel;
    diameterModel       velocityGroup;
    velocityGroupCoeffs
    {
        populationBalance   bubbles;

        shapeModel          spherical;

        sizeGroups
        (
            f0 {dSph 3.00e-03; value 1;}
            f1 {dSph 3.01e-03; value 0;}
            f2 {dSph 3.02e-03; value 0;}
            f3 {dSph 3.03e-03; value 0;}
            f4 {dSph 3.04e-03; value 0;}
            f5 {dSph 3.05e-03; value 0;}
        );
    }

    residualAlpha       1e-6;
}

air2
{
    type                pureIsothermalPhaseModel;
    diameterModel       velocityGroup;
    velocityGroupCoeffs
    {
        populationBalance   bubbles;

        shapeModel          spherical;

        sizeGroups
        (
            f6 {dSph 3.06e-03; value 1;}
            f7 {dSph 3.07e-03; value 0;}
            f8 {dSph 3.08e-03; value 0;}
            f9 {dSph 3.09e-03; value 0;}
            f10{dSph 3.10e-03; value 0;}
        );
    }

    residualAlpha       1e-6;
}

air3
{
    type                pureIsothermalPhaseModel;
    diameterModel       velocityGroup;
    velocityGroupCoeffs
    {
        populationBalance   bubbles;

        shapeModel          spherical;

        sizeGroups
        (
            f11{dSph 3.11e-03; value 1;}
            f12{dSph 3.12e-03; value 0;}
            f13{dSph 3.13e-03; value 0;}
            f14{dSph 3.14e-03; value 0;}
            f15{dSph 3.15e-03; value 0;}
        );
    }

    residualAlpha       1e-6;
}

water
{
    type                pureIsothermalPhaseModel;
    diameterModel       constant;
    constantCoeffs
    {
        d               1e-4;
    }

    residualAlpha       1e-6;
}

populationBalanceCoeffs
{
    bubbles
    {
        continuousPhase water;

        coalescenceModels
        ();

        binaryBreakupModels
        ();

        breakupModels
        ();

        driftModels
        (
            densityChange{}
        );

        nucleationModels
        ();
    }
}

aspectRatio
();

blending
{
    default
    {
        type            none;
        continuousPhase water;
    }
}

drag
(
    (air1 in water)
    {
        type            SchillerNaumann;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }

    (air2 in water)
    {
        type            SchillerNaumann;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }

    (air3 in water)
    {
        type            SchillerNaumann;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }
);

heatTransfer
();

interfaceCompression
();

lift
();

phaseTransfer
();

surfaceTension
();

turbulentDispersion
();

virtualMass
();

wallLubrication
();

pMin                    10000;

// ************************************************************************* //
